leetcode_458_poor_pigs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Leetcode: 458. Poor Pigs</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">

</head>
<body>
<!--  --><nav><span class="nav-header">Problem Solving</span><span class="nav-items"><a href="index.html">Home</a><span></nav><div id="content" class="content">
<h1 class="title">Leetcode: 458. Poor Pigs</h1>
<p>
<a href="https://leetcode.com/problems/poor-pigs/">Problem Statement</a>
</p>

<ul class="org-ul">
<li><a href="mistake_failed_to_consider_different_strategies_to_solve_the_problem.html#ID-3C649CC4-0609-4686-96C3-5F774F9C0292">Mistake: Failed to consider different strategies to solve the problem</a>.  I was stuck on trying to compute the minimum number of tries given a number of pigs and buckets.</li>

<li><a href="mistake_failed_to_consider_different_strategies_to_solve_the_problem.html#ID-3C649CC4-0609-4686-96C3-5F774F9C0292">Mistake: Failed to consider different strategies to solve the problem</a>.  I saw that two pigs with one could cover at most \(2^x\) buckets, but failed to see how to extend this the second, third and so on tries.</li>

<li><a href="can_we_simplify_the_problem_which_keeping_it_the_same.html#ID-F19C9539-EE46-41EE-8DEF-24C3076C6DC2">Can we simplify the problem while keeping it the same?</a>  Given that \(x\) pigs and one try, we know that they can find the solution for at most \(2^x\) buckets.  This is so because each bucket has an unique id in the base 2.  To represent the next try, we have to increase the base.  So, all buckets will have an unique id which means that an unique combination of pigs die maps to only one bucket.  Time complexity is \(O(\log_b n)\) where \(n\) is the number of buckets and \(b\) is the number of tries.  Space complexity is \(O(1)\).</li>
</ul>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> math <span style="font-weight: bold;">import</span> comb


<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">poorPigs</span>(<span style="font-weight: bold;">self</span>, buckets: <span style="font-weight: bold;">int</span>, minutesToDie: <span style="font-weight: bold;">int</span>, minutesToTest: <span style="font-weight: bold;">int</span>) -&gt; <span style="font-weight: bold;">int</span>:
        digits = ceil(minutesToTest / minutesToDie + 1)
        <span style="font-weight: bold; font-style: italic;">cur</span> = 1
        <span style="font-weight: bold; font-style: italic;">ans</span> = 0
        <span style="font-weight: bold;">while</span> cur &lt; <span style="font-weight: bold; font-style: italic;">buckets</span>:
            cur *= digits
            <span style="font-weight: bold; font-style: italic;">ans</span> += 1
        <span style="font-weight: bold;">return</span> ans


<span style="font-weight: bold;">assert</span> Solution().poorPigs(1000, 15, 60) == 5
<span style="font-weight: bold;">assert</span> Solution().poorPigs(4, 15, 15) == 2
<span style="font-weight: bold;">assert</span> Solution().poorPigs(4, 15, 30) == 2
</pre>
</div>
</div>
</body>
</html>